In [1]:
import pandas as pd

# Erstelle Dataframe df
df = pd.DataFrame({'id' : [1,2,3,4], 'Name': ['John', 'Alice', 'Mike', 'Anne'], 'Age': [26, 20, 21, 25]})
df

   id   Name  Age
0   1   John   26
1   2  Alice   20
2   3   Mike   21
3   4   Anne   25

In [2]:
df['nc_score'] = [2.5,3,2.2,1.0]
df

   id   Name  Age  nc_score
0   1   John   26       2.5
1   2  Alice   20       3.0
2   3   Mike   21       2.2
3   4   Anne   25       1.0

In [3]:
df2 = df.loc[df['Age'] < 23]
df2

   id   Name  Age  nc_score
1   2  Alice   20       3.0
2   3   Mike   21       2.2